---
kind: property
id: P:Autodesk.Revit.DB.ThermalAsset.Name
source: html/e5bdeb16-7032-06c5-c450-efe0b182c621.htm
---
# Autodesk.Revit.DB.ThermalAsset.Name Property

The name of the thermal asset.

## Syntax (C#)
```csharp
public string Name { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null